# LayerTypeMaterials Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..LayerTypeMaterials Property
ParameterTypeId Class See Also
---
"Material": Material
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId LayerTypeMaterials { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LayerTypeMaterials As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ LayerTypeMaterials {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace